Revit 2027 API
CableSize.NeutralConductorSize Property
 The size of a Neutral Conductor.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NeutralConductorSize { get; set; }
Public Property NeutralConductorSize As ElementId
	Get
	Set
public:
property ElementId^ NeutralConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
member NeutralConductorSize : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Conductor Size id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Each Neutral Conductor has the same size.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace